package lesson_02.task_02;

/*
Разработать наиболее эффективные алгоритмы и написать код для решения следующих задач:
- найти наибольшую цифру натурального числа;
- проверить, является ли заданное натуральное число палиндромом;
- определить является ли заданное натуральное число простым;
- найти все простые делители заданного натурального числа;
- найти НОД и НОК двух натуральных чисел a и b.
- найти количество различных цифр у заданного натурального числа.
 */

import java.util.Random;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        MagicNumbers mg = new MagicNumbers();
    }
}
